RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/serial-flash/cy_serial_flash_qspi.c
/***********************************************************************************************//**
 * \file cy_serial_flash_qspi.c
 *
 * \brief
 * Provides APIs for interacting with an external flash connected to the SPI or
 * QSPI interface, uses SFDP to auto-discover memory properties if SFDP is
 * enabled in the configuration.
 *
 ***************************************************************************************************
 * \copyright
 * Copyright 2018-2022 Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include <stdbool.h>
#include "cy_serial_flash_qspi.h"
#include "cyhal_qspi.h"
#include "cy_trigmux.h"
#include "cy_dma.h"
#include "cy_utils.h"

#if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
#include <stdlib.h>
#include "cyabs_rtos.h"
#endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */

#ifdef CY_IP_MXSMIF

#if defined(__cplusplus)
extern "C" {
#endif


/** \cond INTERNAL */

/** Timeout to apply while polling the memory for its ready status after quad
 *  enable command has been sent out. Quad enable is a non-volatile write.
 */
#define CY_SERIAL_FLASH_QUAD_ENABLE_TIMEOUT_US      (5000lu) // in microseconds

/** Number of loops to run while polling the SMIF for its busy status. */
#define SMIF_BUSY_CHECK_LOOP_COUNT                  (10lu)

/** Timeout to apply per loop while polling the SMIF for its busy status. */
#define SMIF_BUSY_CHECK_TIMEOUT_MS                  (1lu) // in milliseconds

// Number of memories supported by the driver
#define SMIF_MEM_DEVICES                            (1u)

// SMIF slot from which the memory configuration is picked up - fixed to 0 as
// the driver supports only one device
#define MEM_SLOT                                    (0u)

/* Maximum number of bytes that can be read by SMIF in one transfer */
#define SMIF_MAX_RX_COUNT                           (65536lu)

#define DMA_YCOUNT_ONE_LOOP                         (1lu)

#define MSB_SHIFT_EIGHT                             (0x08u)
#define LSB_MASK                                    (0xFFlu)

/* Masks used for checking the flag bits */
#define FLAG_QSPI_HAL_INIT_DONE                     (0x01lu << 0)
#define FLAG_DMA_INIT_DONE                          (0x01lu << 1)
#define FLAG_READ_IN_PROGRESS                       (0x01lu << 2)

#define IS_FLAG_SET(mask)                           (status_flags & (mask))
#define SET_FLAG(mask)                              (status_flags |= (mask))
#define CLEAR_FLAG(mask)                            (status_flags &= ~(mask))

#if defined(CY_DEVICE_PSOC6ABLE2)
/* You cannot simply change these values. The trigger mux connect code in
 * _init_dma() needs to be updated correspondingly.
 */
    #define RX_DMA_INSTANCE             DW1
    #define RX_DMA_CHANNEL_NUM          (15lu)
    #define RX_DMA_CH0_IRQn             (cpuss_interrupts_dw1_0_IRQn)
#elif defined(CY_DEVICE_PSOC6A2M) || defined(CY_DEVICE_PSOC6A512K) || defined(CY_DEVICE_PSOC6A256K)
/* In these devices, only 1to1 triggers are available between SMIF and a
 * specific combination of DW instances and channel numbers.
 * i.e. TX trigger request from SMIF can connect only to DW1 CH22 and
 * RX trigger request from SMIF can connect only to DW1 CH23.
 */
    #define RX_DMA_INSTANCE             DW1
    #define RX_DMA_CHANNEL_NUM          (23lu)
    #define RX_DMA_CH0_IRQn             (cpuss_interrupts_dw1_0_IRQn)

    #define DEVICE_GROUP_1TO1_TRIGGER
#elif defined(CY_DEVICE_CYW20829)
    #define RX_DMA_INSTANCE             DW0
    #define RX_DMA_CHANNEL_NUM          (0u)
    #define RX_DMA_CH0_IRQn             (cpuss_interrupts_dw0_0_IRQn)
#else // if defined(CY_DEVICE_PSOC6ABLE2)
    #define DMA_UNSUPPORTED
#endif // if defined(CY_DEVICE_PSOC6ABLE2)

#define DMA_CHANNEL_PRIORITY            (3lu)
#define DMA_INTR_PRIORITY               (7lu)

/** \endcond */

static cyhal_qspi_t qspi_obj;
static volatile uint32_t status_flags;
static cy_stc_smif_mem_config_t* qspi_mem_config[SMIF_MEM_DEVICES];

static cy_stc_smif_block_config_t qspi_block_config =
{
    // The number of SMIF memories defined.
    .memCount     = SMIF_MEM_DEVICES,
    // The pointer to the array of memory config structures of size memCount.
    .memConfig    = (cy_stc_smif_mem_config_t**)qspi_mem_config,
    // The version of the SMIF driver.
    .majorVersion = CY_SMIF_DRV_VERSION_MAJOR,
    // The version of the SMIF driver.
    .minorVersion = CY_SMIF_DRV_VERSION_MINOR
};

#if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
static cy_mutex_t serial_flash_mutex;
#endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */

#ifndef DMA_UNSUPPORTED
typedef struct
{
    uint32_t addr;
    size_t length;
    uint8_t* buf;
    cy_serial_flash_qspi_read_complete_callback_t callback;
    void* callback_arg;
} read_txfr_info_t;

static read_txfr_info_t read_txfr_info;

/* DMA related variables */
static cy_stc_dma_descriptor_t dma_descr;

/* Default DW descriptor config */
static cy_stc_dma_descriptor_config_t dma_descr_config =
{
    .retrigger       = CY_DMA_RETRIG_4CYC,
    .interruptType   = CY_DMA_DESCR,
    .triggerOutType  = CY_DMA_DESCR_CHAIN,
    .channelState    = CY_DMA_CHANNEL_ENABLED,
    .triggerInType   = CY_DMA_DESCR,
    .dataSize        = CY_DMA_BYTE,
    .srcTransferSize = CY_DMA_TRANSFER_SIZE_WORD,
    .dstTransferSize = CY_DMA_TRANSFER_SIZE_DATA,
    .descriptorType  = CY_DMA_2D_TRANSFER,
    .srcAddress      = 0,
    .dstAddress      = 0,
    .srcXincrement   = 0U,
    .dstXincrement   = 1U,
    .xCount          = 1UL,
    .srcYincrement   = 0U,
    .dstYincrement   = CY_DMA_LOOP_COUNT_MAX,
    .yCount          = 1UL,
    .nextDescriptor  = &dma_descr,
};

