RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/serial-flash/cy_serial_flash_qspi.c
/* Default DW channel config */
static cy_stc_dma_channel_config_t dma_channel_config =
{
    .descriptor  = &dma_descr,
    .preemptable = false,
    .priority    = DMA_CHANNEL_PRIORITY,
    .enable      = false,
    .bufferable  = false,
};

static const cyhal_resource_inst_t DW_obj =
{
    .type        = CYHAL_RSC_DW,
    .block_num   = ((uint32_t)RX_DMA_INSTANCE - DW0_BASE)/sizeof(DW_Type),
    .channel_num = RX_DMA_CHANNEL_NUM
};

static cy_rslt_t _init_dma(void);
static cy_rslt_t _deinit_dma(void);
static void _rx_dma_irq_handler(void);
static cy_en_smif_status_t _read_next_chunk(void);
#if !defined(CY_DEVICE_CYW20829)
static void _value_to_byte_array(uint32_t value, uint8_t* byte_array, uint32_t start_pos,
                                 uint32_t size);
#endif /* #if !defined(CY_DEVICE_CYW20829) */
#endif /* #ifndef DMA_UNSUPPORTED */

static inline cy_rslt_t _mutex_acquire(void);
static inline cy_rslt_t _mutex_release(void);

#if defined(CY_DEVICE_CYW20829)
static cy_stc_smif_context_t SMIFContext;
#endif /* defined(CY_DEVICE_CYW20829) */

//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_init
//
// The driver supports only one memory. When multiple memory configurations are generated by the
// SMIF configurator tool, provide only the configuration for memory that need to be supported by
// the driver.  Memory configuration can be changed by deinit followed by init with new
// configuration
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_init(
    const cy_stc_smif_mem_config_t* mem_config,
    cyhal_gpio_t io0,
    cyhal_gpio_t io1,
    cyhal_gpio_t io2,
    cyhal_gpio_t io3,
    cyhal_gpio_t io4,
    cyhal_gpio_t io5,
    cyhal_gpio_t io6,
    cyhal_gpio_t io7,
    cyhal_gpio_t sclk,
    cyhal_gpio_t ssel,
    uint32_t hz)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_en_smif_status_t smif_status = CY_SMIF_SUCCESS;

    #if (CYHAL_API_VERSION >= 2)
    // SMIF is already initialized for 20829 hence we can skip calling cyhal_qspi_init.
    // initializing only the SMIF base address and the context variables for 20829.
    #if defined(CY_DEVICE_CYW20829)
    qspi_obj.base = SMIF0;
    qspi_obj.context = SMIFContext;
    #else /* defined(CY_DEVICE_CYW20829) */
    cyhal_qspi_slave_pin_config_t memory_pin_set =
    {
        .io   = { io0, io1, io2, io3, io4, io5, io6, io7 },
        .ssel = ssel
    };
    result = cyhal_qspi_init(&qspi_obj, sclk, &memory_pin_set, hz, 0, NULL);
    #endif /* defined(CY_DEVICE_CYW20829) */

    #else /* HAL API version 1 */
    result = cyhal_qspi_init(&qspi_obj, io0, io1, io2, io3, io4, io5, io6, io7, sclk, ssel, hz, 0);
    #endif /* HAL API version 1 */

    qspi_mem_config[MEM_SLOT] = (cy_stc_smif_mem_config_t*)mem_config;

    if (CY_RSLT_SUCCESS == result)
    {
        SET_FLAG(FLAG_QSPI_HAL_INIT_DONE);

        // Perform SFDP detection and XIP register configuration depending on the memory
        // configuration.
        smif_status = Cy_SMIF_MemInit(qspi_obj.base, &qspi_block_config, &qspi_obj.context);
        if (CY_SMIF_SUCCESS == smif_status)
        {
            // Enable Quad mode (1-1-4 or 1-4-4 modes) to use all the four I/Os during
            // communication.

            if ((qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->readCmd->dataWidth ==
                 CY_SMIF_WIDTH_QUAD) ||
                (qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->programCmd->dataWidth ==
                 CY_SMIF_WIDTH_QUAD))
            {
                bool isQuadEnabled = false;
                smif_status =
                    Cy_SMIF_MemIsQuadEnabled(qspi_obj.base, qspi_block_config.memConfig[MEM_SLOT],
                                             &isQuadEnabled, &qspi_obj.context);
                if ((CY_SMIF_SUCCESS == smif_status) && !isQuadEnabled)
                {
                    smif_status =
                        Cy_SMIF_MemEnableQuadMode(qspi_obj.base,
                                                  qspi_block_config.memConfig[MEM_SLOT],
                                                  CY_SERIAL_FLASH_QUAD_ENABLE_TIMEOUT_US,
                                                  &qspi_obj.context);
                }
            }
            if (CY_SMIF_SUCCESS == smif_status)
            {
                #ifndef DMA_UNSUPPORTED
                result = _init_dma();

                if (CY_RSLT_SUCCESS == result)
                {
                    SET_FLAG(FLAG_DMA_INIT_DONE);
                #endif /* #ifndef DMA_UNSUPPORTED */

                #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
                /* Initialize the mutex */
                result = cy_rtos_init_mutex(&serial_flash_mutex);
                #endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */

                #ifndef DMA_UNSUPPORTED
            }
                #endif /* #ifndef DMA_UNSUPPORTED */
            }
        }
    }

    if ((CY_RSLT_SUCCESS != result) || (CY_SMIF_SUCCESS != smif_status))
    {
        cy_serial_flash_qspi_deinit();

        if (CY_SMIF_SUCCESS != smif_status)
        {
            result = (cy_rslt_t)smif_status;
        }
    }

    return result;
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_deinit
//--------------------------------------------------------------------------------------------------
void cy_serial_flash_qspi_deinit(void)
{
    cy_rslt_t result;

    if (IS_FLAG_SET(FLAG_QSPI_HAL_INIT_DONE))
    {
        /* For CYW20829, BOOTROM enables XIP by default and user is not expected to
           disable memory while in XIP */
        #if !defined(CY_DEVICE_CYW20829)
        if (qspi_obj.base != NULL)
        {
            /* There is no harm in calling this even if Cy_SMIF_MemInit() did
             * not succeed since anyway we own the QSPI object.
             */
            Cy_SMIF_MemDeInit(qspi_obj.base);
        }

        cyhal_qspi_free(&qspi_obj);
        #endif /* !defined(CY_DEVICE_CYW20829) */
        CLEAR_FLAG(FLAG_QSPI_HAL_INIT_DONE);

        #ifndef DMA_UNSUPPORTED
        if (IS_FLAG_SET(FLAG_DMA_INIT_DONE))
        {
            result = _deinit_dma();
            CY_ASSERT(CY_RSLT_SUCCESS == result);

            CLEAR_FLAG(FLAG_DMA_INIT_DONE);
        #endif /* #ifndef DMA_UNSUPPORTED */

