RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/serial-flash/cy_serial_flash_qspi.c
        #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
        result = cy_rtos_deinit_mutex(&serial_flash_mutex);
        CY_ASSERT(CY_RSLT_SUCCESS == result);
        #endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */

        #ifndef DMA_UNSUPPORTED
    }
        #endif /* #ifndef DMA_UNSUPPORTED */
    }

    CY_UNUSED_PARAMETER(result); /* To avoid compiler warning in Release mode. */
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_get_size
//--------------------------------------------------------------------------------------------------
size_t cy_serial_flash_qspi_get_size(void)
{
    return (size_t)qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->memSize;
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_get_erase_size
//--------------------------------------------------------------------------------------------------
size_t cy_serial_flash_qspi_get_erase_size(uint32_t addr)
{
    size_t                            erase_sector_size;
    cy_stc_smif_hybrid_region_info_t* hybrid_info = NULL;

    cy_en_smif_status_t smif_status =
        Cy_SMIF_MemLocateHybridRegion(qspi_block_config.memConfig[MEM_SLOT], &hybrid_info, addr);

    if (CY_SMIF_SUCCESS != smif_status)
    {
        erase_sector_size = (size_t)qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->eraseSize;
    }
    else
    {
        erase_sector_size = (size_t)hybrid_info->eraseSize;
    }

    return erase_sector_size;
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_get_prog_size
//--------------------------------------------------------------------------------------------------
size_t cy_serial_flash_qspi_get_prog_size(uint32_t addr)
{
    CY_UNUSED_PARAMETER(addr);
    return (size_t)qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->programSize;
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_read
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_read(uint32_t addr, size_t length, uint8_t* buf)
{
    cy_rslt_t result_mutex_rel = CY_RSLT_SUCCESS;

    cy_rslt_t result = _mutex_acquire();

    if (CY_RSLT_SUCCESS == result)
    {
        // Cy_SMIF_MemRead() returns error if (addr + length) > total flash size.
        result = (cy_rslt_t)Cy_SMIF_MemRead(qspi_obj.base, qspi_block_config.memConfig[MEM_SLOT],
                                            addr,
                                            buf, length, &qspi_obj.context);
        result_mutex_rel = _mutex_release();
    }

    /* Give priority to the status of SMIF operation when both SMIF operation
     * and mutex release fail.
     */
    return ((CY_RSLT_SUCCESS == result) ? result_mutex_rel : result);
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_abort_read
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_abort_read(void)
{
    #ifndef DMA_UNSUPPORTED
    cy_rslt_t result;

    /* Wait until SMIF finishes any pending transfer. */
    for (uint32_t loop = 0; loop < SMIF_BUSY_CHECK_LOOP_COUNT; loop++)
    {
        if (!Cy_SMIF_BusyCheck(qspi_obj.base))
        {
            break;
        }

        cyhal_system_delay_ms(SMIF_BUSY_CHECK_TIMEOUT_MS);
    }

    if (Cy_SMIF_BusyCheck(qspi_obj.base))
    {
        SET_FLAG(FLAG_READ_IN_PROGRESS);
        result = CY_RSLT_SERIAL_FLASH_ERR_QSPI_BUSY;
    }
    else
    {
        Cy_DMA_Channel_Disable(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);
        result = CY_RSLT_SUCCESS;
        CLEAR_FLAG(FLAG_READ_IN_PROGRESS);
    }

    return result;
    #else // ifndef DMA_UNSUPPORTED
    return CY_RSLT_SERIAL_FLASH_ERR_UNSUPPORTED;
    #endif /* #ifndef DMA_UNSUPPORTED */
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_read_async
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_read_async(uint32_t addr, size_t length, uint8_t* buf,
                                          cy_serial_flash_qspi_read_complete_callback_t callback,
                                          void* callback_arg)
{
    #ifndef DMA_UNSUPPORTED
    cy_rslt_t result = CY_RSLT_SERIAL_FLASH_ERR_BAD_PARAM;
    cy_rslt_t result_mutex_rel = CY_RSLT_SUCCESS;

    CY_ASSERT(NULL != buf);

    if (IS_FLAG_SET(FLAG_READ_IN_PROGRESS))
    {
        result = CY_RSLT_SERIAL_FLASH_ERR_READ_BUSY; /* Previous read request is not yet complete.
                                                      */
    }
    else if ((addr + length) <= cy_serial_flash_qspi_get_size())
    {
        result = _mutex_acquire();

        if (CY_RSLT_SUCCESS == result)
        {
            read_txfr_info.addr = addr;
            read_txfr_info.length = length;
            read_txfr_info.buf = buf;
            read_txfr_info.callback = callback;
            read_txfr_info.callback_arg = callback_arg;

            /* Enable the DMA channel */
            Cy_DMA_Channel_Enable(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);

            SET_FLAG(FLAG_READ_IN_PROGRESS);
            result = (cy_rslt_t)_read_next_chunk();  /* Start the read transfer */

            if (CY_RSLT_SUCCESS != result)
            {
                CLEAR_FLAG(FLAG_READ_IN_PROGRESS);
            }

            result_mutex_rel = _mutex_release();
        }
    }

    /* Give priority to the status of SMIF operation when both SMIF operation
     * and mutex release fail.
     */
    return ((CY_RSLT_SUCCESS == result) ? result_mutex_rel : result);
    #else // ifndef DMA_UNSUPPORTED
    CY_UNUSED_PARAMETER(addr);
    CY_UNUSED_PARAMETER(length);
    CY_UNUSED_PARAMETER(buf);
    CY_UNUSED_PARAMETER(callback);
    CY_UNUSED_PARAMETER(callback_arg);

    return CY_RSLT_SERIAL_FLASH_ERR_UNSUPPORTED;
    #endif /* #ifndef DMA_UNSUPPORTED */
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_write
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_write(uint32_t addr, size_t length, const uint8_t* buf)
{
    cy_rslt_t result_mutex_rel = CY_RSLT_SUCCESS;

    cy_rslt_t result = _mutex_acquire();

    if (CY_RSLT_SUCCESS == result)
    {
        // Cy_SMIF_MemWrite() returns error if (addr + length) > total flash size.
        result = (cy_rslt_t)Cy_SMIF_MemWrite(qspi_obj.base, qspi_block_config.memConfig[MEM_SLOT],
                                             addr,
                                             (uint8_t*)buf, length, &qspi_obj.context);
        result_mutex_rel = _mutex_release();
    }

    /* Give priority to the status of SMIF operation when both SMIF operation
     * and mutex release fail.
     */
    return ((CY_RSLT_SUCCESS == result) ? result_mutex_rel : result);
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_erase
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_erase(uint32_t addr, size_t length)
{
    cy_rslt_t result_mutex_rel = CY_RSLT_SUCCESS;

    cy_rslt_t result = _mutex_acquire();

    if (CY_RSLT_SUCCESS == result)
    {
        // If the erase is for the entire chip, use chip erase command
        if ((addr == 0u) && (length == cy_serial_flash_qspi_get_size()))
        {
            result =
                (cy_rslt_t)Cy_SMIF_MemEraseChip(qspi_obj.base,
                                                qspi_block_config.memConfig[MEM_SLOT],
                                                &qspi_obj.context);
        }
        else
        {
            // Cy_SMIF_MemEraseSector() returns error if (addr + length) > total flash size or if
            // addr is not aligned to erase sector size or if (addr + length) is not aligned to
            // erase sector size.
            result =
                (cy_rslt_t)Cy_SMIF_MemEraseSector(qspi_obj.base,
                                                  qspi_block_config.memConfig[MEM_SLOT],
                                                  addr, length, &qspi_obj.context);
        }

