RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/serial-flash/cy_serial_flash_qspi.c
        result_mutex_rel = _mutex_release();
    }

    /* Give priority to the status of SMIF operation when both SMIF operation
     * and mutex release fail.
     */
    return ((CY_RSLT_SUCCESS == result) ? result_mutex_rel : result);
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_enable_xip
//
// This function enables or disables XIP on the MCU, does not send any command
// to the serial flash. XIP register configuration is already done as part of
// cy_serial_flash_qspi_init() if MMIO mode is enabled in the QSPI
// Configurator.
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_serial_flash_qspi_enable_xip(bool enable)
{
    if (enable)
    {
        Cy_SMIF_SetMode(qspi_obj.base, CY_SMIF_MEMORY);
    }
    else
    {
        Cy_SMIF_SetMode(qspi_obj.base, CY_SMIF_NORMAL);
    }

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_set_interrupt_priority
//--------------------------------------------------------------------------------------------------
void cy_serial_flash_qspi_set_interrupt_priority(uint8_t priority)
{
    #if defined(CY_DEVICE_CYW20829)
    NVIC_SetPriority(smif_interrupt_normal_IRQn, priority);
    #else /* defined(CY_DEVICE_CYW20829) */
    NVIC_SetPriority(smif_interrupt_IRQn, priority);
    #endif /* defined(CY_DEVICE_CYW20829) */
}


//--------------------------------------------------------------------------------------------------
// cy_serial_flash_qspi_set_interrupt_priority
//--------------------------------------------------------------------------------------------------
void cy_serial_flash_qspi_set_dma_interrupt_priority(uint8_t priority)
{
    #ifndef DMA_UNSUPPORTED
    NVIC_SetPriority((IRQn_Type)(RX_DMA_CH0_IRQn + RX_DMA_CHANNEL_NUM), priority);
    #else
    CY_UNUSED_PARAMETER(priority);
    #endif /* #ifndef DMA_UNSUPPORTED */
}


#ifndef DMA_UNSUPPORTED
//--------------------------------------------------------------------------------------------------
// _read_next_chunk
//--------------------------------------------------------------------------------------------------
static cy_en_smif_status_t _read_next_chunk(void)
{
    cy_en_smif_status_t smif_status = CY_SMIF_SUCCESS;
    uint32_t chunk;
    #if !defined(CY_DEVICE_CYW20829)
    uint8_t addr_array[CY_SMIF_FOUR_BYTES_ADDR] = { 0U };
    #endif /* !defined(CY_DEVICE_CYW20829) */

    if (read_txfr_info.length > 0UL)
    {
        /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple
           chunks */
        chunk =
            (read_txfr_info.length >
             SMIF_MAX_RX_COUNT) ? (SMIF_MAX_RX_COUNT) : read_txfr_info.length;

        /* In 2D transfer, (X_count x Y_count) should be a multiple of CY_DMA_LOOP_COUNT_MAX (256).
         */
        if (chunk > CY_DMA_LOOP_COUNT_MAX)
        {
            /* Make chunk divisible by CY_DMA_LOOP_COUNT_MAX (256) by masking out the LS bits */
            chunk &= ~(CY_DMA_LOOP_COUNT_MAX - 1);

            dma_descr_config.yCount = chunk/CY_DMA_LOOP_COUNT_MAX;
            dma_descr_config.xCount = CY_DMA_LOOP_COUNT_MAX;
        }
        else
        {
            dma_descr_config.yCount = DMA_YCOUNT_ONE_LOOP;
            dma_descr_config.xCount = chunk;
        }

        dma_descr_config.dstAddress = (void*)read_txfr_info.buf;
        #if defined(CY_DEVICE_CYW20829)
        dma_descr_config.dataSize = CY_DMA_BYTE;
        dma_descr_config.srcTransferSize = CY_DMA_TRANSFER_SIZE_DATA,
        dma_descr_config.srcXincrement = 1;
        dma_descr_config.srcAddress =
            (void*)(qspi_block_config.memConfig[MEM_SLOT]->baseAddress + read_txfr_info.addr);
        #endif /* defined(CY_DEVICE_CYW20829) */
        Cy_DMA_Descriptor_Init(&dma_descr, &dma_descr_config);

        #if defined(CY_DEVICE_CYW20829)
        Cy_TrigMux_SwTrigger(TRIG_OUT_MUX_0_PDMA0_TR_IN0, CY_TRIGGER_TWO_CYCLES);
        #else /* defined(CY_DEVICE_CYW20829) */
        /* Pass NULL for buffer (and callback) so that the function does not
         * set up FIFO interrupt. We don't need FIFO interrupt to be setup
         * since we will be using DMA.
         */
        _value_to_byte_array(read_txfr_info.addr, &addr_array[0], 0UL,
                             qspi_block_config.memConfig[MEM_SLOT]->deviceCfg->numOfAddrBytes);
        smif_status = Cy_SMIF_MemCmdRead(qspi_obj.base, qspi_block_config.memConfig[MEM_SLOT],
                                         addr_array, NULL, chunk, NULL, &qspi_obj.context);

        if (CY_SMIF_SUCCESS == smif_status)
        #endif /* defined(CY_DEVICE_CYW20829) */
        {
            /* Recalculate the next rxBuffer offset */
            read_txfr_info.length -= chunk;
            read_txfr_info.addr += chunk;
            read_txfr_info.buf += chunk;
        }
    }

    return smif_status;
}


//--------------------------------------------------------------------------------------------------
// _init_dma
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _init_dma(void)
{
    cy_rslt_t result;

    /* Set the source address of the descriptor */
    dma_descr_config.srcAddress = (void*)&SMIF_RX_DATA_FIFO_RD1(qspi_obj.base);

    /* Configure the RX DMA */
    result =
        (cy_rslt_t)Cy_DMA_Channel_Init(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM, &dma_channel_config);

    if (CY_RSLT_SUCCESS == result)
    {
        Cy_DMA_Channel_SetInterruptMask(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM, CY_DMA_INTR_MASK);
        Cy_DMA_Enable(RX_DMA_INSTANCE);

        /* Configure interrupt for RX DMA */
        cy_stc_sysint_t dma_intr_config =
            { .intrSrc        = (IRQn_Type)(RX_DMA_CH0_IRQn + RX_DMA_CHANNEL_NUM),
              .intrPriority   = DMA_INTR_PRIORITY };

        result = (cy_rslt_t)Cy_SysInt_Init(&dma_intr_config, _rx_dma_irq_handler);

        if (CY_RSLT_SUCCESS == result)
        {
            NVIC_EnableIRQ(dma_intr_config.intrSrc);

            /* Configure the trigger mux */
            #if defined(DEVICE_GROUP_1TO1_TRIGGER)
            result = (cy_rslt_t)Cy_TrigMux_Select(TRIG_OUT_1TO1_3_SMIF_RX_TO_PDMA1_TR_IN23, false,
                                                  TRIGGER_TYPE_LEVEL);
            #else //defined(DEVICE_GROUP_1TO1_TRIGGER)
            #if !defined(CY_DEVICE_CYW20829)

            result = (cy_rslt_t)Cy_TrigMux_Connect(TRIG13_IN_SMIF_TR_RX_REQ,
                                                   TRIG13_OUT_TR_GROUP0_INPUT42, false,
                                                   TRIGGER_TYPE_LEVEL);

            if (CY_RSLT_SUCCESS == result)
            {
                result = (cy_rslt_t)Cy_TrigMux_Connect(TRIG1_IN_TR_GROUP13_OUTPUT15,
                                                       TRIG1_OUT_CPUSS_DW1_TR_IN15, false,
                                                       TRIGGER_TYPE_LEVEL);
            }
            #endif /*defined(CY_DEVICE_CYW20829)*/
            #endif /* #if defined(DEVICE_GROUP_1TO1_TRIGGER) */
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* Reserve the DW instance so that HAL will not be able to use it later. */
        result = cyhal_hwmgr_reserve(&DW_obj);
    }

    return result;
}


//--------------------------------------------------------------------------------------------------
// _deinit_dma
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _deinit_dma(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    NVIC_DisableIRQ((IRQn_Type)(RX_DMA_CH0_IRQn + RX_DMA_CHANNEL_NUM));

