RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/serial-flash/cy_serial_flash_qspi.c
    /* Disable only the channel, not the DW instance as it may be used by other
     * part of the application.
     */
    Cy_DMA_Channel_Disable(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);

    /* Free the DMA resource so that HAL can use it now */
    cyhal_hwmgr_free(&DW_obj);

    #if defined(DEVICE_GROUP_1TO1_TRIGGER)
    result = (cy_rslt_t)Cy_TrigMux_Deselect(TRIG_OUT_1TO1_3_SMIF_RX_TO_PDMA1_TR_IN23);
    #else
    /* No PDL function is available for handling deinit for non-1to1 trigger muxes. */
    #endif /* #if defined(DEVICE_GROUP_1TO1_TRIGGER) */

    return result;
}


//--------------------------------------------------------------------------------------------------
// _rx_dma_irq_handler
//--------------------------------------------------------------------------------------------------
static void _rx_dma_irq_handler(void)
{
    cy_en_smif_status_t smif_status = CY_SMIF_SUCCESS;
    bool terminate_read_txfr = true;
    cy_en_dma_intr_cause_t cause = Cy_DMA_Channel_GetStatus(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);

    Cy_DMA_Channel_ClearInterrupt(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);

    if (CY_DMA_INTR_CAUSE_COMPLETION == cause)
    {
        if (read_txfr_info.length > 0UL)
        {
            smif_status = _read_next_chunk();

            if (CY_SMIF_SUCCESS == smif_status)
            {
                terminate_read_txfr = false;
            }
        }
    }
    else
    {
        smif_status = (cy_en_smif_status_t)CY_RSLT_SERIAL_FLASH_ERR_DMA;
    }

    if (terminate_read_txfr)
    {
        Cy_DMA_Channel_Disable(RX_DMA_INSTANCE, RX_DMA_CHANNEL_NUM);
        CLEAR_FLAG(FLAG_READ_IN_PROGRESS);

        /* Execute the callback */
        if (NULL != read_txfr_info.callback)
        {
            read_txfr_info.callback((cy_rslt_t)smif_status, read_txfr_info.callback_arg);
        }
    }
}


#if !defined(CY_DEVICE_CYW20829)
/*******************************************************************************
* Function Name: _value_to_byte_array
****************************************************************************//**
*
* Unpacks the specified number of bytes from a 32-bit value into the given byte
* array.
*
* \param value
* The 32-bit (4-byte) value to unpack.
*
* \param byte_array
* The byte array to fill.
*
* \param start_pos
* The start position of the byte array to begin filling from.
*
* \param size
* The number of bytes to unpack.
*
*******************************************************************************/
static void _value_to_byte_array(uint32_t value, uint8_t* byte_array, uint32_t start_pos,
                                 uint32_t size)
{
    CY_ASSERT((0lu < size) && (CY_SMIF_FOUR_BYTES_ADDR >= size));
    CY_ASSERT(NULL != byte_array);

    do
    {
        size--;
        byte_array[size + start_pos] = (uint8_t)(value & LSB_MASK);
        value >>= MSB_SHIFT_EIGHT; /* Shift to get the next byte */
    } while (size > 0U);
}


#endif /* #if !defined(CY_DEVICE_CYW20829)*/

#endif /* #ifndef DMA_UNSUPPORTED */

//--------------------------------------------------------------------------------------------------
// _mutex_acquire
//--------------------------------------------------------------------------------------------------
static inline cy_rslt_t _mutex_acquire(void)
{
    #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
    return cy_rtos_get_mutex(&serial_flash_mutex, CY_RTOS_NEVER_TIMEOUT);
    #else
    return CY_RSLT_SUCCESS;
    #endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */
}


//--------------------------------------------------------------------------------------------------
// _mutex_release
//--------------------------------------------------------------------------------------------------
static inline cy_rslt_t _mutex_release(void)
{
    #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE)
    return cy_rtos_set_mutex(&serial_flash_mutex);
    #else
    return CY_RSLT_SUCCESS;
    #endif /* #if defined(CY_SERIAL_FLASH_QSPI_THREAD_SAFE) */
}


#if defined(__cplusplus)
}
#endif

#endif // CY_IP_MXSMIF
